In [1]:
import pandas as pd
from sqlalchemy import create_engine, inspect
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
avo_data = pd.read_csv('avocado.csv')
avo_data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,51,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,51,1/4/2015,1.00,435021.49,364302.39,23821.16,82.15,46815.79,16707.15,30108.64,0.0,conventional,2015,Atlanta
2,51,1/4/2015,1.08,788025.06,53987.31,552906.04,39995.03,141136.68,137146.07,3990.61,0.0,conventional,2015,BaltimoreWashington
3,51,1/4/2015,1.01,80034.32,44562.12,24964.23,2752.35,7755.62,6064.30,1691.32,0.0,conventional,2015,Boise
4,51,1/4/2015,1.02,491738.00,7193.87,396752.18,128.82,87663.13,87406.84,256.29,0.0,conventional,2015,Boston

In [3]:
new_df = avo_data.drop(['Unnamed: 0', 'type','Total Volume', '4046', '4225', '4770','Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'year'], axis=1)
new_df.head()

       Date  AveragePrice               region
0  1/4/2015          1.22               Albany
1  1/4/2015          1.00              Atlanta
2  1/4/2015          1.08  BaltimoreWashington
3  1/4/2015          1.01                Boise
4  1/4/2015          1.02               Boston

In [13]:
avo_dates = new_df.groupby('Date').mean()
df = avo_dates.reset_index()
df.head()

         Date  AveragePrice
0   1/11/2015      1.370648
1   1/18/2015      1.391111
2   1/25/2015      1.397130
3    1/4/2015      1.301296
4  10/11/2015      1.373333

In [5]:
connection_string = 'root:password@localhost/avocado_db'
engine = create_engine('mysql://root:password@localhost/avocado_db')
# engine = create_engine(f'mysql://{connection_string}')

In [6]:
if not database_exists(engine.url):
    create_database(engine.url)
    
print(database_exists(engine.url))

True

C:\Users\iwils\Anaconda3\envs\pythondata\lib\site-packages\pymysql\cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

In [7]:
conn = engine.connect()

In [8]:
inspector = inspect(engine)

In [9]:
df.to_sql(name='test', con=engine, if_exists='append', index=True)

In [10]:
engine.table_names()

['test']

In [11]:
pd.read_sql_query('select * from test', con=engine).head()

   index        Date  AveragePrice
0      0   1/11/2015      1.370648
1      1   1/18/2015      1.391111
2      2   1/25/2015      1.397130
3      3    1/4/2015      1.301296
4      4  10/11/2015      1.373333